import ContentBlock from "./content-block";
import image1 from "@/assets/images/image1.webp";
import image10 from "@/assets/images/image10.webp";
import image14 from "@/assets/images/image14.webp";

export default function CivilServantCriteria() {
  return (
    <>
      <ContentBlock
        image={image10.src}
        titleNumber="01"
        title="លក្ខខណ្ឌទី១៖ លក្ខខណ្ឌតម្រូវមូលដ្ឋាន"
        description={`បេក្ខជនត្រូវមានលក្ខខណ្ឌតម្រូវដូចខាងក្រោម៖<br />
          > ត្រូវមានសញ្ជាតិខ្មែរ<br />
          > ទទួលបានសញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល ដែលមាននិន្ទេសរួម A B ឬ C<br />
          > ជាបេក្ខជនដែលបានបំពេញគ្រប់លក្ខខណ្ឌនៃការជ្រើសរើសឱ្យចុះឈ្មោះចូលរៀននៅតាមគ្រឹះស្ថានជាដៃគូទាំងអស់របស់ ក.អ.ជ.ឌ.<br />
          > អាចឆ្លងកាត់ការប្រលង និង/ឬ ការសម្ភាស ដែលរៀបចំដោយ ក.អ.ជ.ឌ.<br />
          > ត្រូវបានលើកទឹកចិត្តចំពោះបេក្ខជនមានជីវភាពក្រីក្រមកពីជនបទដាច់ស្រយាល ជាជនមានពិការភាពជានារី`}
      />
      <ContentBlock
        image={image14.src}
        titleNumber="02"
        title="លក្ខខណ្ឌទី២៖ សំណុំលិខិតភ្ជាប់នៅពេលបំពេញពាក្យចុះឈ្មោះស្នើសុំដំបូង"
        description={`បេក្ខជនត្រូវស្កេនភ្ជាប់មកជាមួយនូវឯកសារយោងនៅពេលបំពេញពាក្យស្នើសុំតាមប្រព័ន្ធអនឡាញ រួមមាន៖ <br />
          > រូបថត ៤x៦ ផ្ទៃស<br />
          > សញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ ឬវិញ្ញាបនបត្របណ្តោះអាសន្នមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល<br />
          > អត្តសញ្ញាណប័ណ្ណ ឬលិខិតឆ្លងដែន ឬសំបុត្រកំណើត<br />
          > សៀវភៅគ្រួសារ ឬសៀវភៅស្នាក់នៅ `}
      />
      <ContentBlock
        image={image1.src}
        titleNumber="03"
        title="លក្ខខណ្ឌទី៣៖ សំណុំលិខិតភ្ជាប់នៅក្រោយពេលជាប់ជាស្ថាពរ"
        description={`
        
            <div>
            <p>> ជីវប្រវត្តិសង្ខេបមានបិទរូបថត (រូបថត ៤x៦ ផ្ទៃ២)</p>
            <p>> កិច្ចព្រមព្រៀងស្តីពីការផ្តល់ថវិកាសិក្សាសម្រាប់កម្មវិធីអភិវឌ្ឍន៍ជំនាញឌីជីថល</p>
            <p>> លិខិតធានាអះអាងពីអាណាព្យាបាល ឬសហព័ទ្ធ</p>
            <p>> សញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ ឬវិញ្ញាបនបត្របណ្តោះអាសន្នមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល (មាន ឃ្យូ.អ.កូដ ស្តង់ដា ឬបញ្ជាក់ត្រឹមត្រូវ) </p>
            <p>> អត្តសញ្ញាណប័ណ្ណ ឬលិខិតឆ្លងដែន ច្បាប់ថតចម្លង (មានបញ្ជាក់ត្រឹមត្រូវ) </p>
            <p>> សេចក្តីចម្លងសំបុត្របញ្ជាក់កំណើត </p>
            <p> > សៀវភៅគ្រួសារ ឬសៀវភៅស្នាក់នៅ ច្បាប់ថតចម្លង (មានបញ្ជាក់ត្រឹមត្រូវ)</p>
            </div>
            <div>
            <p>ចំនួន ០១ ច្បាប់</p>
            <p>ចំនួន ០១ ច្បាប់</p>
            <p>ចំនួន ០១ ច្បាប់</p>
            <p>ចំនួន ០១ ច្បាប់</p>
            <p>ចំនួន ០១ ច្បាប់</p>
            <p>ចំនួន ០១ ច្បាប់</p>
            <p>ចំនួន ០១ ច្បាប់</p>
            </div>
          
          
          `}
      />
    </>
  );
}
