import ContentBlock from "./ContentBlock";
import image1 from "@/assets/images/image1.webp";
import image10 from "@/assets/images/image10.webp";
import image14 from "@/assets/images/image14.webp";

interface StudentCriteriaProps {
  translations: Record<string, string>;
}
export default function StudentCriteria({
  translations,
  lang,
}: StudentCriteriaProps & { lang: "en" | "km" }) {
  const t = (key: string) => translations[key] || key;
  return (
    <>
      <ContentBlock
        image={image10.src}
        titleNumber= "01"
        title="លក្ខខណ្ឌទី១៖ លក្ខខណ្ឌតម្រូវមូលដ្ឋាន"
        description={
          <article>
            បេក្ខជនត្រូវមានលក្ខខណ្ឌតម្រូវដូចខាងក្រោម ៖
            <ol className="list-decimal pl-5 leading-6">
              <li>ត្រូវមានសញ្ជាតិខ្មែរ</li>
              <li>
                ទទួលបានសញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល
                ដែលមាននិន្ទេសរួម A B ឬ C
              </li>
              <li>
                ជាបេក្ខជនដែលបានបំពេញគ្រប់លក្ខខណ្ឌនៃការជ្រើសរើសឱ្យចុះឈ្មោះចូលរៀននៅតាមគ្រឹះស្ថានជាដៃគូទាំងអស់របស់
                ក.អ.ជ.ឌ.
              </li>
              <li>អាចឆ្លងកាត់ការប្រលង និង/ឬ ការសម្ភាស ដែលរៀបចំដោយ ក.អ.ជ.ឌ.</li>
              <li>
                ត្រូវបានលើកទឹកចិត្តចំពោះបេក្ខជនមានជីវភាពក្រីក្រមកពីជនបទដាច់ស្រយាល
                ជាជនមានពិការភាពជានារី
              </li>
            </ol>
          </article>
        }
      />
      <ContentBlock
        image={image14.src}
        titleNumber="02"
        title="លក្ខខណ្ឌទី២៖ សំណុំលិខិតភ្ជាប់នៅពេលបំពេញពាក្យចុះឈ្មោះស្នើសុំដំបូង"
        description={
          <article>
            បេក្ខជនត្រូវស្កេនភ្ជាប់មកជាមួយនូវឯកសារយោងនៅពេលបំពេញពាក្យស្នើសុំតាមប្រព័ន្ធអនឡាញ
            រួមមាន ៖
            <ol className="list-decimal pl-5 leading-6">
              <li>រូបថត ៤x៦ ផ្ទៃស</li>
              <li>
                សញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ
                ឬវិញ្ញាបនបត្របណ្តោះអាសន្នមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល
              </li>
              <li> អត្តសញ្ញាណប័ណ្ណ ឬលិខិតឆ្លងដែន ឬសំបុត្រកំណើត</li>
              <li>សៀវភៅគ្រួសារ ឬសៀវភៅស្នាក់នៅ</li>
            </ol>
          </article>
        }
      />
      <ContentBlock
        image={image1.src}
        titleNumber="03"
        title="លក្ខខណ្ឌទី៣៖ សំណុំលិខិតភ្ជាប់នៅក្រោយពេលជាប់ជាស្ថាពរ"
        description={
          <article>
            បេក្ខជនដែលត្រូវបានជ្រើសរើសជាប់ជាស្ថាពរត្រូវមកបង្ហាញខ្លួន
            និងភ្ជាប់មកជាមួយនូវឯកសារតម្រូវរួមមាន ៖
            <ol className="list-decimal pl-5 leading-6">
              <li>
                ជីវប្រវត្តិសង្ខេបមានបិទរូបថត(រូបថត ៤x៦ ផ្ទៃ២) ចំនួន ០១ ច្បាប់
              </li>
              <li>
                កិច្ចព្រមព្រៀងស្តីពីការផ្តល់ថវិកាសិក្សាសម្រាប់កម្មវិធីអភិវឌ្ឍន៍ជំនាញឌីជីថល
                ចំនួន ០២ ច្បាប់
              </li>
              <li>លិខិតធានាអះអាងពីអាណាព្យាបាល ឬសហព័ទ្ធ ចំនួន ០១ ច្បាប់</li>
              <li>
                សញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ
                ឬវិញ្ញាបនបត្របណ្តោះអាសន្នមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល
                (មាន ឃ្យូ.អ.កូដ ស្តង់ដា ឬបញ្ជាក់ត្រឹមត្រូវ) ចំនួន ០១ ច្បាប់
              </li>
              <li>
                អត្តសញ្ញាណប័ណ្ណ ឬលិខិតឆ្លងដែន ច្បាប់ថតចម្លង
                (មានបញ្ជាក់ត្រឹមត្រូវ) ចំនួន ០១ ច្បាប់
              </li>
              <li>សេចក្តីចម្លងសំបុត្របញ្ជាក់កំណើត ចំនួន ០១ ច្បាប់</li>
              <li>
                សៀវភៅគ្រួសារ ឬសៀវភៅស្នាក់នៅ ច្បាប់ថតចម្លង (មានបញ្ជាក់ត្រឹមត្រូវ)
                ចំនួន ០១ ច្បាប់
              </li>
            </ol>
          </article>
        }
      />
    </>
  );
}
