export function Content1() {
  return (
    <article>
      បេក្ខជនត្រូវមានលក្ខខណ្ឌតម្រូវដូចខាងក្រោម ៖
      <ol className="list-decimal pl-5 leading-6">
        <li>ត្រូវមានសញ្ជាតិខ្មែរ</li>
        <li>
          ទទួលបានសញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល ដែលមាននិន្ទេសរួម
          A B ឬ C
        </li>
        <li>
          ជាបេក្ខជនដែលបានបំពេញគ្រប់លក្ខខណ្ឌនៃការជ្រើសរើសឱ្យចុះឈ្មោះចូលរៀននៅតាមគ្រឹះស្ថានជាដៃគូទាំងអស់របស់
          ក.អ.ជ.ឌ.
        </li>
        <li>អាចឆ្លងកាត់ការប្រលង និង/ឬ ការសម្ភាស ដែលរៀបចំដោយ ក.អ.ជ.ឌ.</li>
        <li>
          ត្រូវបានលើកទឹកចិត្តចំពោះបេក្ខជនមានជីវភាពក្រីក្រមកពីជនបទដាច់ស្រយាល
          ជាជនមានពិការភាពជានារី
        </li>
      </ol>
    </article>
  );
}
export function Content2() {
  return (
    <article>
      បេក្ខជនត្រូវស្កេនភ្ជាប់មកជាមួយនូវឯកសារយោងនៅពេលបំពេញពាក្យស្នើសុំតាមប្រព័ន្ធអនឡាញ
      រួមមាន ៖
      <ol className="list-decimal pl-5 leading-6">
        <li>រូបថត ៤x៦ ផ្ទៃស</li>
        <li>
          សញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ
          ឬវិញ្ញាបនបត្របណ្តោះអាសន្នមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល
        </li>
        <li> អត្តសញ្ញាណប័ណ្ណ ឬលិខិតឆ្លងដែន ឬសំបុត្រកំណើត</li>
        <li>សៀវភៅគ្រួសារ ឬសៀវភៅស្នាក់នៅ</li>
      </ol>
    </article>
  );
}

export function Content3() {
  return (
    <article>
      បេក្ខជនដែលត្រូវបានជ្រើសរើសជាប់ជាស្ថាពរត្រូវមកបង្ហាញខ្លួន
      និងភ្ជាប់មកជាមួយនូវឯកសារតម្រូវរួមមាន ៖
      <table className="w-full">
        <tr>
          <td className="sm:py-0 py-2">
            1. ជីវប្រវត្តិសង្ខេបមានបិទរូបថត(រូបថត ៤x៦ ផ្ទៃ២)
          </td>
          <td className="w-[20%] text-right">ចំនួន ០១ ច្បាប់</td>
        </tr>
        <tr>
          <td className="sm:py-0 py-2">
            2.
            កិច្ចព្រមព្រៀងស្តីពីការផ្តល់ថវិកាសិក្សាសម្រាប់កម្មវិធីអភិវឌ្ឍន៍ជំនាញឌីជីថល
          </td>
          <td className="w-[20%] text-right">ចំនួន ០២ ច្បាប់</td>
        </tr>
        <tr>
          <td className="sm:py-0 py-2">
            3. លិខិតធានាអះអាងពីអាណាព្យាបាល ឬសហព័ទ្ធ
          </td>
          <td className="w-[20%] text-right">ចំនួន ០១ ច្បាប់</td>
        </tr>
        <tr>
          <td className="sm:py-0 py-2">
            4. សញ្ញាបត្រមធ្យមសិក្សាទុតិយភូមិ
            ឬវិញ្ញាបនបត្របណ្តោះអាសន្នមធ្យមសិក្សាទុតិយភូមិ ឬសញ្ញាបត្រសមមូល (មាន
            ឃ្យូ.អ.កូដ ស្តង់ដា ឬបញ្ជាក់ត្រឹមត្រូវ)
          </td>
          <td className="w-[20%] text-right">ចំនួន ០១ ច្បាប់</td>
        </tr>
        <tr>
          <td className="sm:py-0 py-2">
            5. អត្តសញ្ញាណប័ណ្ណ ឬលិខិតឆ្លងដែន ច្បាប់ថតចម្លង
            (មានបញ្ជាក់ត្រឹមត្រូវ)
          </td>
          <td className="w-[20%] text-right">ចំនួន ០១ ច្បាប់</td>
        </tr>
        <tr>
          <td className="sm:py-0 py-2">6. សេចក្តីចម្លងសំបុត្របញ្ជាក់កំណើត</td>
          <td className="w-[20%] text-right">ចំនួន ០១ ច្បាប់</td>
        </tr>
        <tr>
          <td className="sm:py-0 py-2">
            7. សៀវភៅគ្រួសារ ឬសៀវភៅស្នាក់នៅ ច្បាប់ថតចម្លង (មានបញ្ជាក់ត្រឹមត្រូវ)
          </td>
          <td className="w-[20%] text-right">ចំនួន ០១ ច្បាប់</td>
        </tr>
      </table>
    </article>
  );
}
